test_sh/db_bench.txt
2024年 07月 27日 星期六 17:29:33 CST
./db_bench --db=/database_sdd/wisckeydb_dbbench_test --benchmarks=fillrandom,stats --num=2097152 --value_size=992 --threads=1 --histogram=1 >> db_bench.txt
Keys:       24 bytes each
Values:     992 bytes each (496 bytes after compression)
Entries:    2097152
RawSize:    2032.0 MB (estimated)
FileSize:   1040.0 MB (estimated)
------------------------------------------------
fillrandom   :       1.557 micros/op;  622.1 MB/s
Microseconds per op:
Count: 2097152  Average: 1.5575  StdDev: 4.86
Min: 0.0000  Median: 1.8764  Max: 6469.0000
------------------------------------------------------
[       0,       1 )      84   0.004%   0.004% 
[       1,       2 ) 1196425  57.050%  57.054% ###########
[       2,       3 )  730965  34.855%  91.909% #######
[       3,       4 )  153885   7.338%  99.247% #
[       4,       5 )    3935   0.188%  99.435% 
[       5,       6 )    3228   0.154%  99.588% 
[       6,       7 )    2146   0.102%  99.691% 
[       7,       8 )     420   0.020%  99.711% 
[       8,       9 )    1897   0.090%  99.801% 
[       9,      10 )    1686   0.080%  99.882% 
[      10,      12 )     305   0.015%  99.896% 
[      12,      14 )      78   0.004%  99.900% 
[      14,      16 )      26   0.001%  99.901% 
[      16,      18 )       7   0.000%  99.902% 
[      18,      20 )       7   0.000%  99.902% 
[      20,      25 )    1129   0.054%  99.956% 
[      25,      30 )     817   0.039%  99.995% 
[      30,      35 )      75   0.004%  99.998% 
[      35,      40 )      10   0.000%  99.999% 
[      40,      45 )       7   0.000%  99.999% 
[      45,      50 )       1   0.000%  99.999% 
[      50,      60 )       5   0.000%  99.999% 
[      60,      70 )       3   0.000%  99.999% 
[      70,      80 )       1   0.000% 100.000% 
[      80,      90 )       1   0.000% 100.000% 
[     300,     350 )       1   0.000% 100.000% 
[     500,     600 )       2   0.000% 100.000% 
[     700,     800 )       1   0.000% 100.000% 
[     800,     900 )       1   0.000% 100.000% 
[     900,    1000 )       1   0.000% 100.000% 
[    1000,    1200 )       1   0.000% 100.000% 
[    1200,    1400 )       1   0.000% 100.000% 
[    6000,    7000 )       1   0.000% 100.000% 


                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        3        3         0        0        28
  1        5        9         1       56        52
  2        7       12         0       13        13