test_sh/db_bench.txt
2024年 09月 13日 星期五 22:53:35 CST
./db_bench --db=/database_sdd/wisckeydb_dbbench_test --benchmarks=fillrandom,stats --num=10000000 --value_size=992 --threads=1 --histogram=1 >> db_bench.txt
Keys:       24 bytes each
Values:     992 bytes each (496 bytes after compression)
Entries:    10000000
RawSize:    9689.3 MB (estimated)
FileSize:   4959.1 MB (estimated)
------------------------------------------------
zc 
zc final cur_vlog = 1
Vlog Number: 1
Invalid Size: 0
Valid Count: 0
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 0
Valid Largest Key: 
----------------------------------------
zc 
fillrandom   :      18.091 micros/op;   53.6 MB/s
Microseconds per op:
Count: 10000000  Average: 18.0912  StdDev: 4494.74
Min: 0.0000  Median: 1.9805  Max: 8153218.0000
------------------------------------------------------
[       0,       1 )     175   0.002%   0.002% 
[       1,       2 ) 5099116  50.991%  50.993% ##########
[       2,       3 ) 3726278  37.263%  88.256% #######
[       3,       4 )  956862   9.569%  97.824% ##
[       4,       5 )   59628   0.596%  98.421% 
[       5,       6 )   19700   0.197%  98.618% 
[       6,       7 )   15034   0.150%  98.768% 
[       7,       8 )   13473   0.135%  98.903% 
[       8,       9 )   10387   0.104%  99.007% 
[       9,      10 )    6412   0.064%  99.071% 
[      10,      12 )    4208   0.042%  99.113% 
[      12,      14 )    4525   0.045%  99.158% 
[      14,      16 )    1065   0.011%  99.169% 
[      16,      18 )     595   0.006%  99.175% 
[      18,      20 )     270   0.003%  99.177% 
[      20,      25 )    4074   0.041%  99.218% 
[      25,      30 )    3957   0.040%  99.258% 
[      30,      35 )     207   0.002%  99.260% 
[      35,      40 )      87   0.001%  99.261% 
[      40,      45 )      43   0.000%  99.261% 
[      45,      50 )      24   0.000%  99.261% 
[      50,      60 )      28   0.000%  99.261% 
[      60,      70 )      24   0.000%  99.262% 
[      70,      80 )      46   0.000%  99.262% 
[      80,      90 )     134   0.001%  99.264% 
[      90,     100 )     311   0.003%  99.267% 
[     100,     120 )    3266   0.033%  99.299% 
[     120,     140 )    2352   0.024%  99.323% 
[     140,     160 )    1488   0.015%  99.338% 
[     160,     180 )     535   0.005%  99.343% 
[     180,     200 )     243   0.002%  99.345% 
[     200,     250 )     173   0.002%  99.347% 
[     250,     300 )      12   0.000%  99.347% 
[     300,     350 )       4   0.000%  99.347% 
[     350,     400 )       7   0.000%  99.347% 
[     450,     500 )       3   0.000%  99.347% 
[     500,     600 )       5   0.000%  99.348% 
[     600,     700 )      23   0.000%  99.348% 
[     700,     800 )       9   0.000%  99.348% 
[     800,     900 )      19   0.000%  99.348% 
[     900,    1000 )       8   0.000%  99.348% 
[    1000,    1200 )   54924   0.549%  99.897% 
[    1200,    1400 )    9853   0.099%  99.996% 
[    1400,    1600 )      90   0.001%  99.997% 
[    1600,    1800 )      40   0.000%  99.997% 
[    1800,    2000 )      33   0.000%  99.998% 
[    2000,    2500 )      31   0.000%  99.998% 
[    2500,    3000 )       7   0.000%  99.998% 
[    3000,    3500 )       2   0.000%  99.998% 
[    3500,    4000 )       3   0.000%  99.998% 
[    4000,    4500 )       3   0.000%  99.998% 
[    4500,    5000 )       3   0.000%  99.998% 
[    5000,    6000 )       5   0.000%  99.998% 
[    6000,    7000 )       2   0.000%  99.998% 
[    7000,    8000 )       1   0.000%  99.998% 
[    8000,    9000 )       2   0.000%  99.998% 
[    9000,   10000 )       2   0.000%  99.998% 
[   10000,   12000 )       6   0.000%  99.998% 
[   12000,   14000 )       6   0.000%  99.998% 
[   14000,   16000 )       4   0.000%  99.998% 
[   16000,   18000 )       2   0.000%  99.998% 
[   20000,   25000 )       7   0.000%  99.998% 
[   25000,   30000 )       4   0.000%  99.998% 
[   30000,   35000 )       6   0.000%  99.998% 
[   35000,   40000 )       6   0.000%  99.999% 
[   40000,   45000 )       3   0.000%  99.999% 
[   45000,   50000 )       2   0.000%  99.999% 
[   50000,   60000 )      12   0.000%  99.999% 
[   60000,   70000 )       5   0.000%  99.999% 
[   70000,   80000 )       8   0.000%  99.999% 
[   80000,   90000 )      13   0.000%  99.999% 
[   90000,  100000 )       4   0.000%  99.999% 
[  100000,  120000 )      14   0.000%  99.999% 
[  120000,  140000 )      11   0.000%  99.999% 
[  140000,  160000 )       4   0.000%  99.999% 
[  160000,  180000 )       5   0.000%  99.999% 
[  180000,  200000 )       3   0.000%  99.999% 
[  200000,  250000 )       4   0.000%  99.999% 
[  250000,  300000 )       3   0.000%  99.999% 
[  350000,  400000 )       4   0.000%  99.999% 
[  400000,  450000 )       1   0.000%  99.999% 
[  450000,  500000 )       4   0.000% 100.000% 
[  500000,  600000 )       3   0.000% 100.000% 
[  600000,  700000 )       4   0.000% 100.000% 
[  700000,  800000 )       4   0.000% 100.000% 
[  800000,  900000 )       2   0.000% 100.000% 
[  900000, 1000000 )       3   0.000% 100.000% 
[ 1000000, 1200000 )       6   0.000% 100.000% 
[ 1200000, 1400000 )       4   0.000% 100.000% 
[ 1400000, 1600000 )       4   0.000% 100.000% 
[ 1600000, 1800000 )       5   0.000% 100.000% 
[ 1800000, 2000000 )       3   0.000% 100.000% 
[ 2000000, 2500000 )       4   0.000% 100.000% 
[ 2500000, 3000000 )       1   0.000% 100.000% 
[ 3000000, 3500000 )       3   0.000% 100.000% 
[ 3500000, 4000000 )       1   0.000% 100.000% 
[ 8000000, 9000000 )       1   0.000% 100.000% 


                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2        2        39        0       184
  1       15       28        53      606       582
  2       41       80        31      439       389
                               Gc
FileNumber   GcTime(mis) Read(MB) reWrite(MB)
--------------------------------------------------
  1  8102662      512       429
  2 18265354      512       357
  3 35274747      512       394
  4 16454245      512       326
  5 32145804      512       308
  6 19566661      512       307
  7 13376441      512       275

zc final cur_vlog = 25
Vlog Number: 25
Invalid Size: 0
Valid Count: 0
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 0
Valid Largest Key: 
----------------------------------------
Vlog Number: 24
Invalid Size: 4897020
Valid Count: 350160
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728798
----------------------------------------
Vlog Number: 23
Invalid Size: 26132400
Valid Count: 816996
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728850
----------------------------------------
Vlog Number: 22
Invalid Size: 41791440
Valid Count: 1264703
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728852
----------------------------------------
Vlog Number: 21
Invalid Size: 58198140
Valid Count: 1646942
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728869
----------------------------------------
Vlog Number: 20
Invalid Size: 66999720
Valid Count: 1930928
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728866
----------------------------------------
Vlog Number: 19
Invalid Size: 76184820
Valid Count: 2237628
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728864
----------------------------------------
Vlog Number: 18
Invalid Size: 68332860
Valid Count: 2314039
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728871
----------------------------------------
Vlog Number: 17
Invalid Size: 65670660
Valid Count: 2336034
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728844
----------------------------------------
Vlog Number: 8
Invalid Size: 195109680
Valid Count: 3924918
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728834
----------------------------------------
Vlog Number: 9
Invalid Size: 186022500
Valid Count: 3737637
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728876
----------------------------------------
Vlog Number: 10
Invalid Size: 175924500
Valid Count: 3518590
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728809
----------------------------------------
Vlog Number: 11
Invalid Size: 162370740
Valid Count: 3109217
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728843
----------------------------------------
Vlog Number: 12
Invalid Size: 145789620
Valid Count: 3107379
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728722
----------------------------------------
Vlog Number: 13
Invalid Size: 128195640
Valid Count: 3106811
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728856
----------------------------------------
Vlog Number: 14
Invalid Size: 109956000
Valid Count: 2768036
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728877
----------------------------------------
Vlog Number: 15
Invalid Size: 98868600
Valid Count: 2943810
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728830
----------------------------------------
Vlog Number: 16
Invalid Size: 81116520
Valid Count: 2716595
Valid Smallest Key Size: 0
Valid Smallest Key: 
Valid Largest Key Size: 24
Valid Largest Key: 000000000000000005728874
----------------------------------------